achkou/Custom_Beacon_NRF52/main.c
        // Start advertising.
        err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
        APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
    ret_code_t err_code;

    switch (p_evt->evt_id)
    {
        case PM_EVT_BONDED_PEER_CONNECTED:
        {
            NRF_LOG_INFO("Connected to a previously bonded device.\n");
        } break;

        case PM_EVT_CONN_SEC_SUCCEEDED:
        {
            NRF_LOG_INFO("Connection secured: role: %d, conn_handle: 0x%x, procedure: %d. \n",
                         ble_conn_state_role(p_evt->conn_handle),
                         p_evt->conn_handle,
                         p_evt->params.conn_sec_succeeded.procedure);
        } break;

        case PM_EVT_CONN_SEC_FAILED:
        {
            /* Often, when securing fails, it shouldn't be restarted, for security reasons.
             * Other times, it can be restarted directly.
             * Sometimes it can be restarted, but only after changing some Security Parameters.
             * Sometimes, it cannot be restarted until the link is disconnected and reconnected.
             * Sometimes it is impossible, to secure the link, or the peer device does not support it.
             * How to handle this error is highly application dependent. */
        } break;

        case PM_EVT_CONN_SEC_CONFIG_REQ:
        {
            // Reject pairing request from an already bonded peer.
            pm_conn_sec_config_t conn_sec_config = {.allow_repairing = false};
            pm_conn_sec_config_reply(p_evt->conn_handle, &conn_sec_config);
        } break;

        case PM_EVT_STORAGE_FULL:
        {
            // Run garbage collection on the flash.
            err_code = fds_gc();
            if (err_code == FDS_ERR_NO_SPACE_IN_QUEUES)
            {
                // Retry.
            }
            else
            {
                APP_ERROR_CHECK(err_code);
            }
        } break;

        case PM_EVT_PEERS_DELETE_SUCCEEDED:
        {
            adv_scan_start();
        } break;

        case PM_EVT_PEER_DATA_UPDATE_FAILED:
        {
            // Assert.
            APP_ERROR_CHECK(p_evt->params.peer_data_update_failed.error);
        } break;

        case PM_EVT_PEER_DELETE_FAILED:
        {
            // Assert.
            APP_ERROR_CHECK(p_evt->params.peer_delete_failed.error);
        } break;

        case PM_EVT_PEERS_DELETE_FAILED:
        {
            // Assert.
            APP_ERROR_CHECK(p_evt->params.peers_delete_failed_evt.error);
        } break;

        case PM_EVT_ERROR_UNEXPECTED:
        {
            // Assert.
            APP_ERROR_CHECK(p_evt->params.error_unexpected.error);
        } break;

        case PM_EVT_CONN_SEC_START:
        case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED:
        case PM_EVT_PEER_DELETE_SUCCEEDED:
        case PM_EVT_LOCAL_DB_CACHE_APPLIED:
        case PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED:
            // This can happen when the local DB has changed.
        case PM_EVT_SERVICE_CHANGED_IND_SENT:
        case PM_EVT_SERVICE_CHANGED_IND_CONFIRMED:
        default:
            break;
    }
}

//****************************FDS flash sauvgarde*********
static void my_fds_evt_handler(fds_evt_t const * const p_fds_evt)
{
    switch (p_fds_evt->id)
    {
        case FDS_EVT_INIT:
            if (p_fds_evt->result != FDS_SUCCESS)
            {
                // Initialization failed.
            }
            break;
                case FDS_EVT_WRITE:
                        if (p_fds_evt->result == FDS_SUCCESS)
                        {
                            write_flag_fds_test=1;
                        }
                        break;
        default:
            break;
    }
}

static ret_code_t fds_test_write(void)
{

        uint8_t  m_deadbeef[9] = {0xf0,0x18,0x98,0xcf,0xd1,0x7d,0xfe,0xff,0xef};
        fds_record_t        record;
        fds_record_desc_t   record_desc;

        // Set up data.

        // Set up record.
        record.file_id              = FILE_ID_FDS_TEST;
        record.key                      = REC_KEY_FDS_TEST;
        record.data.p_data       = &m_deadbeef;
        //record.data.length_words   = sizeof(m_deadbeef)/sizeof(uint32_t);
        record.data.length_words   = sizeof(m_deadbeef)/sizeof(uint8_t);

        printf("lentgh : %d\n", record.data.length_words  );
        ret_code_t ret = fds_record_write(&record_desc, &record);
        // if (ret != FDS_SUCCESS)
        // {
        //         return ret;
        // }
        if(ret == FDS_SUCCESS){ printf("If the operation was queued successfully.\n");}
        if(ret == FDS_ERR_NOT_INITIALIZED){ printf("If the module is not initialized\n");}
        if(ret == FDS_ERR_NULL_ARG){ printf(" If p_record is NULL.\n");}
        if(ret == FDS_ERR_INVALID_ARG){ printf("If the file ID or the record key is invalid.\n");}
        if(ret == FDS_ERR_UNALIGNED_ADDR){ printf(" If the record data is not aligned to a 4 byte boundary.\n");}
        if(ret == FDS_ERR_RECORD_TOO_LARGE){ printf(" If the record data exceeds the maximum length.\n");}
        if(ret == FDS_ERR_NO_SPACE_IN_QUEUES){ printf("  If the operation queue is full or there are more record chunks than can be buffered.\n");}
        if(ret == FDS_ERR_NO_SPACE_IN_FLASH ){ printf(" If there is not enough free space in flash to store the record.\n");}



         printf("Writing Record ID = %d \r\n",record_desc.record_id);
        return NRF_SUCCESS;
}

void printBuf(uint8_t* b, int n){
  for(int i=0; i<n; i++)
  {
    printf("%d ",b[i]);
    printf(" ");
  }
  printf("\n");
}
static ret_code_t fds_read(void)
{

        fds_flash_record_t  flash_record;
        fds_record_desc_t   record_desc;
        fds_find_token_t    ftok ={0};//Important, make sure you zero init the ftok token
        //uint32_t *data;
        uint8_t *data;
        uint32_t err_code;

        printf("Start searching... \r\n");
        // Loop until all records with the given key and file ID have been found.
        while (fds_record_find(FILE_ID_FDS_TEST, REC_KEY_FDS_TEST, &record_desc, &ftok) == FDS_SUCCESS)
        {
                err_code = fds_record_open(&record_desc, &flash_record);
                if ( err_code != FDS_SUCCESS)
                {
                    return err_code;
                }

                printf("Found Record ID = %d\r\n",record_desc.record_id);
                printf("Data = ");
                //data = (uint32_t *) flash_record.p_data;
                data = (uint8_t *) flash_record.p_data;
                for (uint8_t i=0;i<flash_record.p_header->length_words;i++)
                {
                    printf("0x%8x ",data[i]);
                }
                printf("\r\n");

