achkou/Custom_Beacon_NRF52/main.c
// This is a timer event handler this one we make it only for sendning values of the mpu
static void timer_timeout_handler(void * p_context)
{
        int* reading = getreading();
        fds_flash_record_t  flash_record;
        fds_record_desc_t   record_desc;
        fds_find_token_t    ftok ={0};//Important, make sure you zero init the ftok token
        //uint32_t *data;
        uint8_t *data;
        ret_code_t err_code;


    // struct tm * now = nrf_cal_get_time();

    // printf( "%4d-%02d-%02d %02d:%02d:%02d\n",
    //     now->tm_year+1900, now->tm_mon+1, now->tm_mday,
    //     now->tm_hour, now->tm_min, now->tm_sec );
//print_current_time();

        macbeef2[5]= ++macbeef2[5];
        macbeef2[7]= ++macbeef2[7];

        if (macbeef2[7]>29)
        {
            // printf("done\n");
             macbeef2[7]=1;
        }
        if (macbeef2[5]>250 )
        {
            //printf("done\n");
             macbeef2[5]=0;
        }


            // printf("Start searching... \r\n");
        if(*reading==1){

            // Loop until all records with the given key and file ID have been found.
            in=0;
            while (fds_record_find(FILE_ID_FDS_TEST, REC_KEY_FDS_TEST, &record_desc, &ftok) == FDS_SUCCESS)
            {

                    err_code = fds_record_open(&record_desc, &flash_record);
                    if ( err_code != FDS_SUCCESS)
                    {
                        return err_code;
                    }

                        nrf_delay_ms(1000);

                        printf("Found Record ID = %d\r\n",record_desc.record_id);

                        //printf("Data = ");
                        //data = (uint32_t *) flash_record.p_data;
                        data = (uint8_t *) flash_record.p_data;
                        for (uint8_t i=0;i<flash_record.p_header->length_words;i++)
                        {
                           // printf("0x%8x ",data[i]);

                            macbeef[i]=data[i];

                        }
                        //printf("\r\n");
                        if (record_desc.record_id==1)
                        {
                            in++;
                            printf("in: %d\n",in );
                            if (in==1)
                            {
                                *reading=0;
                            }
                        }

                        printBuf(macbeef,8);

                            err_code = ble_hrs_heart_rate_measurement_send_1(&m_hrs, macbeef);
                            if ((err_code != NRF_SUCCESS) &&
                                (err_code != NRF_ERROR_INVALID_STATE) &&
                                (err_code != NRF_ERROR_RESOURCES) &&
                                (err_code != NRF_ERROR_BUSY) &&
                                (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
                                )
                            {
                                APP_ERROR_HANDLER(err_code);
                            }

                    // Access the record through the flash_record structure.
                    // Close the record when done.
                    err_code = fds_record_close(&record_desc);
                    if (err_code != FDS_SUCCESS)
                    {
                        return err_code;
                        //Read==false;
                    }
            }
            return NRF_SUCCESS;

        }


            if (pro1==10)
            {
                cnt1++;
                printf("%d\n",cnt1 );
            }
            if (pro2==20)
            {
                cnt2++;
                printf("%d\n",cnt2 );
            }
            if (pro3==30)
            {
                cnt3++;
                printf("%d\n",cnt3 );
            }
            if (pro4==40)
            {
                cnt4++;
                printf("%d\n",cnt4 );
            }
            if (pro5==50)
            {
                cnt5++;
                printf("%d\n",cnt5 );
            }


}

uint8_t MacAdrsse[8];
uint8_t  m_deadbeef[8];
bool kayn;

void writeFDS(uint8_t* b){

         // uint8_t  m_deadbeef[6] = {b[0],b[1],b[2],b[3],b[4],b[5]};
            m_deadbeef[0]=b[0];
            m_deadbeef[1]=b[1];
            m_deadbeef[2]=b[2];
            m_deadbeef[3]=b[3];
            m_deadbeef[4]=b[4];
            m_deadbeef[5]=b[5];
            m_deadbeef[6]=b[6];
            m_deadbeef[7]=b[7];

         printBuff(m_deadbeef,8);
         // uint8_t  m_deadbeef[6] = {0xf0,0x18,0x98,0xcf,0xd1,0x7d};
        // static uint8_t const m_deadbeef[6] = {0xf0,0x18,0x98,0xcf,0xd1,0x7d};
        // static uint32_t const m_deadbeef[2] = {0xDEADBEEF,0xBAADF00D};
        //static uint8_t const m_deadbeef[8] = {0x1,0x2,0x3,0x4,0x51,0x62,0x73,0x84};

        fds_record_t        record;
        fds_record_desc_t   record_desc;

        // Set up data.

        // Set up record.
        record.file_id              = FILE_ID_FDS_TEST;
        record.key                      = REC_KEY_FDS_TEST;
        record.data.p_data       = &m_deadbeef;
        //record.data.length_words   = sizeof(m_deadbeef)/sizeof(uint32_t);
        record.data.length_words   = sizeof(m_deadbeef)/sizeof(uint8_t);

        printf("lentgh : %d\n", record.data.length_words  );
        ret_code_t ret = fds_record_write(&record_desc, &record);
        // if (ret != FDS_SUCCESS)
        // {
        //         return ret;
        // }
        if(ret == FDS_SUCCESS){ printf("If the operation was queued successfully.\n");}
        if(ret == FDS_ERR_NOT_INITIALIZED){ printf("If the module is not initialized\n");}
        if(ret == FDS_ERR_NULL_ARG){ printf(" If p_record is NULL.\n");}
        if(ret == FDS_ERR_INVALID_ARG){ printf("If the file ID or the record key is invalid.\n");}
        if(ret == FDS_ERR_UNALIGNED_ADDR){ printf(" If the record data is not aligned to a 4 byte boundary.\n");}
        if(ret == FDS_ERR_RECORD_TOO_LARGE){ printf(" If the record data exceeds the maximum length.\n");}
        if(ret == FDS_ERR_NO_SPACE_IN_QUEUES){ printf("  If the operation queue is full or there are more record chunks than can be buffered.\n");}
        if(ret == FDS_ERR_NO_SPACE_IN_FLASH ){ printf(" If there is not enough free space in flash to store the record.\n");}



         printf("Writing Record ID = %d \r\n",record_desc.record_id);
        return NRF_SUCCESS;

