achkou/Custom_Beacon_NRF52/main.c
}

uint8_t  macfound[6] ;

bool verifyRead(uint8_t* b){
        bool found;

        fds_flash_record_t  flash_record;
        fds_record_desc_t   record_desc;
        fds_find_token_t    ftok ={0};//Important, make sure you zero init the ftok token
        //uint32_t *data;
        uint8_t *data;
        ret_code_t err_code;

        //printBuff(b,6);
           // printf("Start searching... \r\n");

            // Loop until all records with the given key and file ID have been found.
            while (fds_record_find(FILE_ID_FDS_TEST, REC_KEY_FDS_TEST, &record_desc, &ftok) == FDS_SUCCESS)
            {

                    err_code = fds_record_open(&record_desc, &flash_record);
                    if ( err_code != FDS_SUCCESS)
                    {
                        return err_code;
                    }

                        // nrf_delay_ms(1000);
                        // printf("Found Record ID = %d\r\n",record_desc.record_id);

                        //printf("Data = ");
                        //data = (uint32_t *) flash_record.p_data;
                        data = (uint8_t *) flash_record.p_data;
                        for (uint8_t i=0;i<flash_record.p_header->length_words;i++)
                        {
                            // printf("0x%8x ",data[i]);

                            macfound[i]=data[i];

                        }
                        // printf("\r\n");

                        if(b[0]==macfound[0] && b[1]==macfound[1] && b[2]==macfound[2] && b[3]==macfound[3] && b[4]==macfound[4] && b[5]==macfound[5]){

                            found =true;
                            //printf("mujuuuuuuuud\n");
                        }else{
                            found =false;

                        }


                    // Access the record through the flash_record structure.
                    // Close the record when done.
                    err_code = fds_record_close(&record_desc);
                    if (err_code != FDS_SUCCESS)
                    {
                        return err_code;
                    }
            }



        return found;
}

bool verifyMac(uint8_t* MacAdrsse,uint8_t*  Mac){

    if(Mac[0]==MacAdrsse[0] && Mac[1]==MacAdrsse[1] && Mac[2]==MacAdrsse[2] && Mac[3]==MacAdrsse[3] && Mac[4]==MacAdrsse[4] && Mac[5]==MacAdrsse[5]){

    return true;
    //printf("mujuuuuuuuud\n");
    }else{
    return false;

    }

}
uint8_t Mac1[8],Mac2[8],Mac3[8],Mac4[8],Mac5[8];
bool occupe=false;
bool prev1,prev2,prev3,prev4,prev5;
int baraka=0;
/**@brief Function for handling the advertising report BLE event.
 *
 * @param[in] p_adv_report  Advertising report from the SoftDevice.
 */
static void on_adv_report(ble_gap_evt_adv_report_t const * p_adv_report)
{
    baraka ++;
    ret_code_t err_code;
    nrf_gpio_cfg_output(29);


        if (ble_advdata_uuid_find(p_adv_report->data.p_data, p_adv_report->data.len, &target_uuid))
        {
            //NRF_LOG_INFO("RSSI: %d", p_adv_report->rssi);
            if(p_adv_report->rssi > (-68)){
            nrf_gpio_pin_set(29);
            struct tm * now = nrf_cal_get_time();

            MacAdrsse[0]=p_adv_report->peer_addr.addr[0];
            MacAdrsse[1]=p_adv_report->peer_addr.addr[1];
            MacAdrsse[2]=p_adv_report->peer_addr.addr[2];
            MacAdrsse[3]=p_adv_report->peer_addr.addr[3];
            MacAdrsse[4]=p_adv_report->peer_addr.addr[4];
            MacAdrsse[5]=p_adv_report->peer_addr.addr[5];
            MacAdrsse[6]=now->tm_mon+1;
            MacAdrsse[7]=now->tm_mday;

                    if (verifyMac(MacAdrsse,Mac1)==false&&verifyMac(MacAdrsse,Mac2)==false&& verifyMac(MacAdrsse,Mac3)==false&& cnt1==0 && prev1==false)
                    {
                        Mac1[0]=MacAdrsse[0];
                        Mac1[1]=MacAdrsse[1];
                        Mac1[2]=MacAdrsse[2];
                        Mac1[3]=MacAdrsse[3];
                        Mac1[4]=MacAdrsse[4];
                        Mac1[5]=MacAdrsse[5];
                        printf("mashi b7al b7al1\n");
                        // occupe=true;
                        pro1=10;
                        prev1=true;
                        // prev2=false;
                        // prev3=true;
                        // prev4=true;
                        // prev5=true;


                    }else if (verifyMac(MacAdrsse,Mac1)==false&&verifyMac(MacAdrsse,Mac2)==false&& verifyMac(MacAdrsse,Mac3)==false&& cnt2==0 && prev2==false)
                    {
                        Mac2[0]=MacAdrsse[0];
                        Mac2[1]=MacAdrsse[1];
                        Mac2[2]=MacAdrsse[2];
                        Mac2[3]=MacAdrsse[3];
                        Mac2[4]=MacAdrsse[4];
                        Mac2[5]=MacAdrsse[5];
                        printf("mashi b7al b7al2\n");
                        pro2=20;
                        prev2=true;
                        // prev3=false;
                        // prev4=true;
                        // prev5=true;

                    }else if (verifyMac(MacAdrsse,Mac1)==false&&verifyMac(MacAdrsse,Mac2)==false&& verifyMac(MacAdrsse,Mac3)==false&& cnt3==0&& prev3==false)
                    {
                        Mac3[0]=MacAdrsse[0];
                        Mac3[1]=MacAdrsse[1];
                        Mac3[2]=MacAdrsse[2];
                        Mac3[3]=MacAdrsse[3];
                        Mac3[4]=MacAdrsse[4];
                        Mac3[5]=MacAdrsse[5];
                        printf("mashi b7al b7al3\n");
                        pro3=30;
                        prev3=true;
                        // prev4=true;
                        // prev5=true;

                    }
                        if (cnt1>10 && verifyMac(MacAdrsse,Mac1)==true )
                        {
                            printf("ha da9i9a lewl dazt\n");
                            pro1=0;
                            cnt1=0;
                                kayn = verifyRead(Mac1);
                                if (kayn==true)
                                {
                                    printf("kayn\n");
                                    printf("..");
                                    prev1=false;
                                    Mac1[0]=0;
                                }else{
                                    Mac1[6]=now->tm_mon+1;
                                    Mac1[7]=now->tm_mday;
                                    writeFDS(Mac1);
                                    prev1=false;
                                    Mac1[0]=0;



