achkou/Custom_Beacon_NRF52/main.c
                                }
                        }
                        if (cnt2>10 && verifyMac(MacAdrsse,Mac2)==true)
                        {
                            printf("ha da9i9a 2 dazt\n");
                            pro2=0;
                            cnt2=0;
                                kayn = verifyRead(Mac4);
                                if (kayn==true)
                                {
                                    printf("kayn\n");
                                    printf("..");
                                    prev2=false;
                                    Mac2[0]=0;


                                }else{
                                    Mac2[6]=now->tm_mon+1;
                                    Mac2[7]=now->tm_mday;
                                    writeFDS(Mac2);
                                    prev2=false;
                                    Mac3[0]=0;



                                }
                        }
                        if (cnt3>10 && verifyMac(MacAdrsse,Mac3)==true)
                        {
                            printf("ha da9i9a 3 dazt\n");
                            pro3=0;
                            cnt3=0;

                                kayn = verifyRead(Mac3);
                                if (kayn==true)
                                {
                                    printf("kayn\n");
                                    printf("..");
                                    prev3=false;
                                    Mac3[0]=0;


                                }else{
                                    Mac3[6]=now->tm_mon+1;
                                    Mac3[7]=now->tm_mday;
                                    writeFDS(Mac2);
                                    prev3=false;
                                    Mac3[0]=0;



                                }
                        }

            }else if(p_adv_report->rssi < (-75)){
                nrf_gpio_pin_clear(29);
                // pro=0;
                // cnt1=0;

                        if (cnt1>15 && verifyMac(MacAdrsse,Mac1)==true || cnt1>20)
                        {
                            printf("ha da9i9a lewl saalat\n");
                            pro1=0;
                            cnt1=0;

                                    prev1=false;
                                    Mac1[0]=0;

                        }
                        if (cnt2>15 && verifyMac(MacAdrsse,Mac2)==true || cnt2>20)
                        {
                            printf("ha da9i9a 2 saalat\n");
                            pro2=0;
                            cnt2=0;

                                    prev2=false;
                                    Mac2[0]=0;


                        }
                        if (cnt3>15 && verifyMac(MacAdrsse,Mac3)==true || cnt3>20)
                        {
                            printf("ha da9i9a 3 saalat\n");
                            pro3=0;
                            cnt3=0;

                                    prev3=false;
                                    Mac3[0]=0;

                        }

            }else{
                nrf_gpio_pin_clear(29);
                // pro=0;
                // cnt1=0;

            }



            err_code = sd_ble_gap_scan_start(NULL, &m_scan_buffer);
            APP_ERROR_CHECK(err_code);

        }
        else
        {
            err_code = sd_ble_gap_scan_start(NULL, &m_scan_buffer);
            APP_ERROR_CHECK(err_code);
            nrf_gpio_pin_clear(29);


        }
}


/**@brief Function for assigning new connection handle to available instance of QWR module.
 *
 * @param[in] conn_handle New connection handle.
 */
static void multi_qwr_conn_handle_assign(uint16_t conn_handle)
{
    for (uint32_t i = 0; i < NRF_SDH_BLE_TOTAL_LINK_COUNT; i++)
    {
        if (m_qwr[i].conn_handle == BLE_CONN_HANDLE_INVALID)
        {
            ret_code_t err_code = nrf_ble_qwr_conn_handle_assign(&m_qwr[i], conn_handle);
            APP_ERROR_CHECK(err_code);
            break;
        }
    }
}


/**@brief   Function for handling BLE events from central applications.
 *
 * @details This function parses scanning reports and initiates a connection to peripherals when a
 *          target UUID is found. It updates the status of LEDs used to report central applications
 *          activity.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 */
static void on_ble_central_evt(ble_evt_t const * p_ble_evt)
{
    ret_code_t            err_code;
    ble_gap_evt_t const * p_gap_evt = &p_ble_evt->evt.gap_evt;

    switch (p_ble_evt->header.evt_id)
    {
        // Upon connection, check which peripheral has connected (HR or RSC), initiate DB
        // discovery, update LEDs status and resume scanning if necessary.
        case BLE_GAP_EVT_CONNECTED:
        {
            NRF_LOG_INFO("Central connected \n");
            // If no Heart Rate sensor or RSC sensor is currently connected, try to find them on this peripheral.
            if (   (m_conn_handle_hrs_c  == BLE_CONN_HANDLE_INVALID)
                || (m_conn_handle_rscs_c == BLE_CONN_HANDLE_INVALID))
            {
                NRF_LOG_INFO("Attempt to find HRS or RSC on conn_handle 0x%x \n", p_gap_evt->conn_handle);

                err_code = ble_db_discovery_start(&m_db_discovery[0], p_gap_evt->conn_handle);
                if (err_code == NRF_ERROR_BUSY)
                {
                    err_code = ble_db_discovery_start(&m_db_discovery[1], p_gap_evt->conn_handle);
                    APP_ERROR_CHECK(err_code);
                }
                else
                {
                    APP_ERROR_CHECK(err_code);
                }
            }

            // Assing connection handle to the QWR module.
            multi_qwr_conn_handle_assign(p_gap_evt->conn_handle);

