achkou/Custom_Beacon_NRF52/main.c
}

void calendar_updated()
{
    if(run_time_updates)
    {
        print_current_time();
    }
}

void set_timing()
{

    uint32_t year, month, day, hour, minute, second;

   // NRF_CLOCK->EVENTS_HFCLKSTARTED = 0;
   // NRF_CLOCK->TASKS_HFCLKSTART = 1;
   // while(NRF_CLOCK->EVENTS_HFCLKSTARTED == 0);


    run_time_updates = false;

    year = 2020;
    month = 12;
    day = 27;
    hour =23;
    minute = 59;
    second = 50;

    nrf_cal_set_time(year, month, day, hour, minute, second);

    NRF_LOG_INFO("Time set: ");
    NRF_LOG_INFO("%s", nrf_cal_get_time_string(false));
    NRF_LOG_INFO("\r\n\n");

}

/**@brief Function for application main entry.
 */
int main(void)
{
    bool erase_bonds;



    // Initialize.
    log_init();

    nrf_cal_init();
    nrf_cal_set_callback(calendar_updated, 4);

    timer_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    conn_params_init();
    db_discovery_init();
    peer_manager_init();
    hrs_c_init();
    rscs_c_init();
    services_init();
    advertising_init();
    fds_test_init();
    application_timers_start();

    set_timing();


    // Start execution.
    NRF_LOG_INFO("Relay example started.\n");

    if (erase_bonds == true)
    {
        // Scanning and advertising is done upon PM_EVT_PEERS_DELETE_SUCCEEDED event.
        delete_bonds();
    }
    else
    {
        adv_scan_start();
    }

    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
    }
}
